src/cfe/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДоговорыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>еисКонтракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.еисКонтракты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/CommonModules/ЕИС_МодульБП3/Ext/Module.bsl
Функция НайтиСтрану(КодСтраны) Экспорт

	// Проверка переопределения функции в Общем модуле ЕИС_Переопределения
	ПереопределенныйМодуль = ГМ_ЕИС.ФункцияПереопределена("НайтиСтрану");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.НайтиСтрану(КодСтраны);
	КонецЕсли;

	СтранаПроисхождения = Справочники.СтраныМира.НайтиПоКоду(КодСтраны);

	Если Не ЗначениеЗаполнено(СтранаПроисхождения) Тогда

		ГМ_ЕИС.СообщитьИнфо("Не найдена страна с кодом: " + КодСтраны);	

	КонецЕсли;

	Возврат СтранаПроисхождения ;

КонецФункции     

Функция НайтиЕдиницуИзмерения(КодЕдиницы) Экспорт

	// Проверка переопределения функции в Общем модуле ЕИС_Переопределения
	ПереопределенныйМодуль = ГМ_ЕИС.ФункцияПереопределена("НайтиЕдиницуИзмерения");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.НайтиЕдиницуИзмерения(КодЕдиницы);
	КонецЕсли;

	ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(КодЕдиницы);

	Если Не ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда

		ГМ_ЕИС.СообщитьИнфо("Не найдена единица измерения с кодом: " + КодЕдиницы);	

	КонецЕсли;

	Возврат ЕдиницаИзмерения;

КонецФункции

Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт

	Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда 
		Возврат 0;
	Иначе
		Если СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
			Возврат 18;
		ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
			Возврат 10;
		ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
			Возврат 20;
		ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда
			Возврат 5;
		ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС7 Тогда
			Возврат 7;
		Иначе
			Возврат 0;
		КонецЕсли;
	КонецЕсли;	
		
КонецФункции

Функция КодИНаименованиеЕдиницыИзмеренияКВыгрузке(СтрокаТЧ) Экспорт
	
	// Проверка переопределения функции в Общем модуле ЕИС_Переопределения
	ПереопределенныйМодуль = ГМ_ЕИС.ФункцияПереопределена("КодИНаименованиеЕдиницыИзмеренияКВыгрузке");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.КодИНаименованиеЕдиницыИзмеренияКВыгрузке(СтрокаТЧ);
	КонецЕсли;
	
	ЕдиницаИзмерения = СтрокаТЧ.ЕдиницаИзмерения;
	
	Возврат Новый Структура("Код, Наименование", ЕдиницаИзмерения.Код, ЕдиницаИзмерения.Наименование);
		
КонецФункции

Функция ПолучитьПредставлениеПолейДокументаВЗапрос() Экспорт
	
	// Проверка переопределения функции в Общем модуле ЕИС_Переопределения
	ПереопределенныйМодуль = ГМ_ЕИС.ФункцияПереопределена("ПолучитьПредставлениеПолейДокументаВЗапрос");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.ПолучитьПредставлениеПолейДокументаВЗапрос();
	КонецЕсли;
	
	РеквизитГрузополучатель = Константы.кб99_ЕИС_НазваниеРеквизитаГрузополучатель.Получить();
	
	ТекстЗапросаШтрихкодыУпаковок = "ВЫБРАТЬ
	|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка КАК Документ,
	|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК КодМаркировки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
	|ГДЕ
	|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка В
	|			(ВЫБРАТЬ
	|				т.Ссылка
	|			ИЗ
	|				втЭтапы КАК т)";
	
	ТекстПоляЕдиницаИзмерения = "ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ РеализацияТоваровУслугТовары.ЕдиницаИзмерения
	|	КОНЕЦ";
	
	Результат = Новый Структура;
	Результат.Вставить("ТекстПоляДоговор", "ДоговорКонтрагента");
	Результат.Вставить("ТекстПоляКонтракт", "ДоговорКонтрагента.еисКонтракт");
	Результат.Вставить("ТекстПоляГрузополучатель", ?(ЗначениеЗаполнено(РеквизитГрузополучатель), 
		РеквизитГрузополучатель, "Грузополучатель"));
	Результат.Вставить("ТекстПоляТаблицаТовары", "РеализацияТоваровУслуг.Товары");
	Результат.Вставить("ТекстПоляСерия", "НЕОПРЕДЕЛЕНО");
	Результат.Вставить("ТекстПоляЦенаВключаетНДС", "СуммаВключаетНДС");
	Результат.Вставить("ТекстПоляЕдиницаИзмерения", ТекстПоляЕдиницаИзмерения);
	Результат.Вставить("ТекстЗапросаШтрихкодыУпаковок", ТекстЗапросаШтрихкодыУпаковок);
	Результат.Вставить("ТекстПоляКоэффициент", "1");
	Результат.Вставить("ТекстПоляИсточник", "Документ.РеализацияТоваровУслуг");
	Результат.Вставить("ТекстПоляЦена", "РеализацияТоваровУслугТовары.Цена");
	Результат.Вставить("ТекстПоляКоличество", "Количество");
	Результат.Вставить("ТекстЗапросаУслуги", ";");
	
	Возврат Результат;
	
КонецФункции

Процедура ПолучитьБанковскиеРеквизитыОрганизации(Докум, СведенияОбОрганизации, ПараметрыОрганизации) Экспорт
	
	// Проверка переопределения функции в Общем модуле ЕИС_Переопределения
	ПереопределенныйМодуль = ГМ_ЕИС.ФункцияПереопределена("ПолучитьБанковскиеРеквизитыОрганизации");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		ПереопределенныйМодуль.ПолучитьБанковскиеРеквизитыОрганизации(Докум, СведенияОбОрганизации, ПараметрыОрганизации);
		Возврат;
	КонецЕсли;
	
	БанкСчет = ПараметрыОрганизации["БанковскийСчетОрганизации"];
	Если НЕ ЗначениеЗаполнено(БанкСчет) Тогда 
		ВызватьИсключение "В параметрах ЕИС не выбран банковский счет организации";
	КонецЕсли;
	
	СведенияОбОрганизации.НомерСчета = БанкСчет.НомерСчета;
	СведенияОбОрганизации.Банк = БанкСчет.Банк;
	СведенияОбОрганизации.БИК = СокрЛП(СведенияОбОрганизации.Банк.Код);
	СведенияОбОрганизации.КоррСчет = СведенияОбОрганизации.Банк.КоррСчет;
  
КонецПроцедуры

Процедура ЗаполнитьНомерДатуНаПечать(ДокОтгрузки) Экспорт
	
	// Проверка переопределения функции в Общем модуле ЕИС_Переопределения
	ПереопределенныйМодуль = ГМ_ЕИС.ФункцияПереопределена("ЗаполнитьНомерДатуНаПечать");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		ПереопределенныйМодуль.ЗаполнитьНомерДатуНаПечать(ДокОтгрузки);
		Возврат;
	КонецЕсли;
	
	ДокОснование = ДокОтгрузки.ДокументОснование;
	
	СчетФактура = НайтиПодчиненныйСчетФактура(ДокОснование);
	
	Если ЗначениеЗаполнено(СчетФактура) Тогда
		Номер = СчетФактура.Номер;
		ДокОтгрузки.ДатаНаПечать = СчетФактура.Дата;
		ДокОтгрузки.СтатусУПД = 1;
	Иначе
		Номер = ДокОснование.Номер;
		ДокОтгрузки.ДатаНаПечать = ДокОснование.Дата;
		ДокОтгрузки.СтатусУПД = 2;	
	КонецЕсли;
	
	ДокОтгрузки.НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер, Истина, Истина);
	
КонецПроцедуры

Функция НайтиПодчиненныйСчетФактура(ДокОснование) Экспорт

	// Проверка переопределения функции в Общем модуле ЕИС_Переопределения
	ПереопределенныйМодуль = ГМ_ЕИС.ФункцияПереопределена("НайтиПодчиненныйСчетФактура");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.НайтиПодчиненныйСчетФактура(ДокОснование);
	КонецЕсли;
	
	СчетФактура = УчетНДСПереопределяемый.НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ДокОснование);

	Возврат СчетФактура;
	
КонецФункции

Процедура ЗаполнитьКМОСУ(ДокОтгрузки) Экспорт
	
	// Проверка переопределения функции в Общем модуле ЕИС_Переопределения
	ПереопределенныйМодуль = ГМ_ЕИС.ФункцияПереопределена("ЗаполнитьКМОСУ");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		ПереопределенныйМодуль.ЗаполнитьКМОСУ(ДокОтгрузки);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНомерНаПечать(Докум) Экспорт

	// Проверка переопределения функции в Общем модуле ЕИС_Переопределения
	ПереопределенныйМодуль = ГМ_ЕИС.ФункцияПереопределена("ПолучитьНомерНаПечать");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.ПолучитьНомерНаПечать(Докум);
	КонецЕсли;
	
	Возврат ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СокрЛП(Докум.Номер), Истина, Истина);
	
КонецФункции

Функция ПолучитьСведенияОбОрганизации(Организация) Экспорт

	// Проверка переопределения функции в Общем модуле ЕИС_Переопределения
	ПереопределенныйМодуль = ГМ_ЕИС.ФункцияПереопределена("ПолучитьСведенияОбОрганизации");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.ПолучитьСведенияОбОрганизации(Организация);
	КонецЕсли;
	
	Возврат БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, ТекущаяДатаСеанса());
		
КонецФункции

Функция ПолучитьИмяСправочникаБанковскиеСчета() Экспорт

	Возврат "БанковскиеСчета";
	
КонецФункции

Функция ОписаниеОрганизации(СписокСведений, Список = "") Экспорт

	// Проверка переопределения функции в Общем модуле ЕИС_Переопределения
	ПереопределенныйМодуль = ГМ_ЕИС.ФункцияПереопределена("ОписаниеОрганизации");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.ОписаниеОрганизации(СписокСведений, Список);
	КонецЕсли;

	Возврат ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СписокСведений, Список);
	
КонецФункции

Функция НайтиДоговорКонтрагента(Контрагент, Номер) Экспорт

	// Проверка переопределения функции в Общем модуле ЕИС_Переопределения
	ПереопределенныйМодуль = ГМ_ЕИС.ФункцияПереопределена("НайтиДоговорКонтрагента");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.НайтиДоговорКонтрагента(Контрагент, Номер);
	КонецЕсли;
	
	Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка КАК Договор
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Контрагент
		|	И ДоговорыКонтрагентов.Номер ПОДОБНО &Номер";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номер", Номер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Договор = ВыборкаДетальныеЗаписи.Договор;
	КонецЕсли;
	
	Возврат Договор;
	
КонецФункции
